soap-addressing/src/test/resources/xml/soap-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:urn="urn:switchyard-quickstart:soap-addressing:1.0">
   <soapenv:Header>
   </soapenv:Header>
   <soapenv:Body>
      <urn:order>
         <item>Boeing</item>
         <quantity>10</quantity>
      </urn:order>
   </soapenv:Body>
</soapenv:Envelope>
